_MAP = {
    'a':'ᴧ','b':'ʙ','c':'ᴄ','d':'ᴅ','e':'ᴇ','f':'ғ','g':'ɢ','h':'ʜ',
    'i':'ɪ','j':'ɪ','k':'ᴋ','l':'ʟ','m':'ᴍ','n':'η','o':'ᴏ','p':'ᴘ',
    'q':'ǫ','r':'ʀ','s':'s','t':'ᴛ','u':'ᴜ','v':'ᴠ','w':'ᴡ','x':'x',
    'y':'ʏ','z':'ᴢ',
    'A':'ᴧ','B':'ʙ','C':'ᴄ','D':'ᴅ','E':'ᴇ','F':'ғ','G':'ɢ','H':'ʜ',
    'I':'ɪ','J':'ᴊ','K':'ᴋ','L':'ʟ','M':'ᴍ','N':'η','O':'ᴏ','P':'ᴘ',
    'Q':'ǫ','R':'ʀ','S':'s','T':'ᴛ','U':'ᴜ','V':'ᴠ','W':'ᴡ','X':'x',
    'Y':'ʏ','Z':'ᴢ',
}

def f(t): return ''.join(_MAP.get(c,c) for c in t)
def fb(t): return f"*{f(t)}*"
